Public Member Functions | Public Attributes | List of all members
API_QuantitiesMask Class Reference
Element Manager API
Describes the filter for the different calculated values for skins and elements. More...
#include <APIdefs_Elements.h>
 Public Member Functions
API_QuantitiesMask ()
 Public Attributes
API_ElementQuantityMask  | elements
API_CompositeQuantityMask  | composites
Detailed Description
Describes the filter for the different calculated values for skins and elements.
Constructor & Destructor Documentation
◆ API_QuantitiesMask()
 API_QuantitiesMask::API_QuantitiesMask  |  ( |   | )
inline
Member Data Documentation
◆ composites
 API_CompositeQuantityMask API_QuantitiesMask::composites
◆ elements
 API_ElementQuantityMask API_QuantitiesMask::elements